utci/wStock/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (7.2 0 0);
boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        Uref            7.2;
        Zref            5.460000000000001;
        zDir            (0 0 1);
        flowDir         (1 0 0);
        z0              uniform 0.8;
        zGround         uniform -14.54;
        value           $internalField;
    }
    outlet
    { type            inletOutlet; inletValue      uniform (0 0 0); value           $internalField; }
    terrain      { type            noSlip; }
    roads        { type            noSlip; }
    recreation   { type            noSlip; }
    buildings    { type            noSlip; }
    ground       { type            noSlip; }
    sky          { type            slip; }
    frontAndBack { type            symmetry; }
}