utci/wStock/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.094064;
boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        Uref            7.2;
        Zref            5.460000000000001;
        zDir            (0 0 1);
        flowDir         (1 0 0);
        z0              uniform 0.8;
        zGround         uniform -14.54;
        value           $internalField;
    }
    outlet
    { type            inletOutlet; inletValue      $internalField; value           $internalField; }
    terrain      { type            epsilonWallFunction; value           uniform 0.094064; }
    roads        { type            epsilonWallFunction; value           uniform 0.094064; }
    recreation   { type            epsilonWallFunction; value           uniform 0.094064; }
    buildings    { type            epsilonWallFunction; value           uniform 0.094064; }
    ground       { type            zeroGradient; }
    sky          { type            slip; }
    frontAndBack { type            symmetry; }
}