utci/wStock/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet        { type calculated; value uniform 0; }
    outlet       { type calculated; value uniform 0; }
    terrain      { type nutkAtmRoughWallFunction; z0 uniform 0.8; value uniform 0; }
    roads        { type nutkAtmRoughWallFunction; z0 uniform 0.005; value uniform 0; }
    recreation   { type nutkAtmRoughWallFunction; z0 uniform 0.05; value uniform 0; }
    buildings    { type nutkAtmRoughWallFunction; z0 uniform 0.5; value uniform 0; }
    ground       { type calculated; value uniform 0; }
    sky          { type slip; }
    frontAndBack { type symmetry; }
}